tutorials/immersedBoundary/pitzDailyTurbulentSimpleIbFoam/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    pitzDailyIB
    {
        type immersedBoundaryVelocityWallFunction;
        patchType immersedBoundary;

        refValue uniform (0 0 0);
        refGradient  uniform (0 0 0);
        fixesValue yes;

        setDeadCellValue   yes;
        deadCellValue      (0 0 0);

        value uniform (0 0 0);
    }
    inlet
    {
        type fixedValue;
        value uniform (10 0 0);

    }
    outlet
    {
        type inletOutlet;
        inletValue uniform (0 0 0);
        value uniform (10 0 0);
    }
    top
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    bottom
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
